{
  "format": "graph-model",
  "generatedBy": "2.9.1",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "signature":
  {
      "inputs":
      {
          "input_1": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"112"},{"size":"112"},{"size":"3"}]}}
      },
      "outputs":
      {
          "embedding": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"512"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_11/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"12"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_11/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"12"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_12/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"12"},{"size":"192"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_12/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_1/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_15/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_15/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_16/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"384"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_16/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"384"}]}}}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_2/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_19/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_19/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"24"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_20/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"384"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_20/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_3/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_23/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"576"},{"size":"24"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_23/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_24/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"576"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_24/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"576"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_4/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_27/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"28"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_27/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"28"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_28/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"28"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_28/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_5/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_31/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"28"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_31/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"28"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_32/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"28"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_32/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_6/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_35/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"28"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_35/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"28"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_36/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"28"},{"size":"672"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_36/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_7/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_39/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"28"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_39/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"28"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_40/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"28"},{"size":"672"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_40/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_8/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_43/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"28"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_43/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"28"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_44/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"28"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_44/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_9/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_47/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_47/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_48/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_48/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_10/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_51/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_51/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_52/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"1152"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_52/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_11/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_55/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_55/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_56/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_56/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_12/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_59/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_59/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_60/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"1152"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_60/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_13/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_63/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_63/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_64/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_64/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_14/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_67/Conv2D/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_67/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_68/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_68/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/tf.math.reduce_mean_15/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_71/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_71/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_72/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_72/BiasAdd/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/GDC_conv/Conv2D/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1280"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/GDC_flatten/Const","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/pre_embedding/batchnorm/mul","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/pre_embedding/batchnorm/sub","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"input_1","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"112"},{"size":"112"},{"size":"3"}]}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"16"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_3/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_4/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"128"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_5/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_6/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_7/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"48"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_8/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"48"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_9/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_9/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"48"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_10/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"48"},{"size":"192"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_10/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"192"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_13/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"96"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_14/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"384"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_14/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_17/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"96"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_17/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_18/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"384"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_18/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"384"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"384"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_21/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"384"},{"size":"96"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_21/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"96"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_22/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"96"},{"size":"576"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_22/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"576"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"576"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"576"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_25/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"576"},{"size":"112"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_25/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_26/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_26/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_29/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_29/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_30/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_30/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_33/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_33/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_34/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_34/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_37/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_37/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_38/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_38/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_41/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"112"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_41/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"112"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_42/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"112"},{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_42/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"672"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"672"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_45/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"672"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_45/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_46/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_46/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_49/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_49/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_50/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_50/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_53/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_53/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_54/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_54/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_57/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_57/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_58/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_58/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_61/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_61/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_62/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_62/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_13/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_65/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_65/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_66/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_66/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_14/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_69/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_69/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_70/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_70/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1152"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_15/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1152"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_73/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1152"},{"size":"192"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_73/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"192"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_74/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"192"},{"size":"1280"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_74/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1280"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/GDC_dw/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"4"},{"size":"4"},{"size":"1280"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/GDC_dw/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1280"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Cast","op":"Cast","input":["input_1"],"attr":{"Truncate":{"b":false},"DstT":{"type":"DT_HALF"},"SrcT":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv2d/Cast","StatefulPartitionedCall/model/conv2d/Conv2D_weights"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv2d/Conv2D","StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/activation/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/activation/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3","StatefulPartitionedCall/model/activation/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/activation/mul_1","StatefulPartitionedCall/model/conv2d_1/Conv2D_weights"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_HALF"},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv2d_1/Conv2D","StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/activation_1/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/activation_1/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3","StatefulPartitionedCall/model/activation_1/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/activation_1/mul_1","StatefulPartitionedCall/model/conv2d_2/Conv2D_weights"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_HALF"},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","2","2","1"]}}}},
