{
  "format": "graph-model",
  "generatedBy": "2.9.1",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "signature":
  {
      "inputs":
      {
          "input_1": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"112"},{"size":"112"},{"size":"3"}]}}
      },
      "outputs":
      {
          "embedding": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"512"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"StatefulPartitionedCall/model/activation_47/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"664"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_45/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"168"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_44/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"332"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_43/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"332"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_42/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"624"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_41/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"624"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_39/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"312"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_38/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"624"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_37/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"624"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_36/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"624"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_35/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"624"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_33/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"220"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_32/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"436"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_31/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"436"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_29/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"220"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_28/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"436"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_27/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"436"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_25/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"156"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_24/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"312"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_23/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"312"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_22/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"120"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_21/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"120"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_20/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"120"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_19/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"120"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_18/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"130"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_17/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"130"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_16/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"156"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_15/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"156"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_13/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_12/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"78"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_11/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"78"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_9/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_8/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"46"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_7/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"46"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_6/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"46"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_5/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"46"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_4/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_3/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_2/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"10"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_1/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"10"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation/Neg","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"20"}]}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_1/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_2/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_3/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_4/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_5/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_6/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape/strided_slice/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape/Reshape/shape/1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/reshape/Reshape/shape/2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape/Reshape/shape/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_9/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"92"},{"size":"24"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_9/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"24"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_10/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"24"},{"size":"92"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_10/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"92"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_10/Const","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_10/Const_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_10/clip_by_value/Minimum/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_10/clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_7/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_8/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/global_average_pooling2d_1/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_1/strided_slice/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_1/strided_slice/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_1/strided_slice/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_1/Reshape/shape/1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_1/Reshape/shape/2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_1/Reshape/shape/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_14/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"156"},{"size":"40"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_14/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"40"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_15/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"40"},{"size":"156"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_15/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"156"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_14/Const","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_14/Const_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_14/clip_by_value/Minimum/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_14/clip_by_value/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_9/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_10/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_11/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_12/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_13/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_14/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_15/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_16/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_17/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_18/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/global_average_pooling2d_2/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_2/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_2/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_2/strided_slice/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_2/Reshape/shape/1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_2/Reshape/shape/2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_2/Reshape/shape/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_27/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"624"},{"size":"156"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_27/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"156"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_28/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"156"},{"size":"624"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_28/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"624"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_26/Const","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_26/Const_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_26/clip_by_value/Minimum/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_26/clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_19/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_20/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/global_average_pooling2d_3/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_3/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_3/strided_slice/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_3/strided_slice/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_3/Reshape/shape/1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_3/Reshape/shape/2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_3/Reshape/shape/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_32/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"872"},{"size":"220"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_32/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"220"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_33/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"220"},{"size":"872"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_33/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"872"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_30/Const","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_30/Const_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_30/clip_by_value/Minimum/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_30/clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_21/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_22/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/global_average_pooling2d_4/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_4/strided_slice/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_4/strided_slice/stack_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_4/strided_slice/stack_2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_4/Reshape/shape/1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_4/Reshape/shape/2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_4/Reshape/shape/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_36/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"872"},{"size":"220"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_36/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"220"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_37/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"220"},{"size":"872"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_37/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"872"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_34/Const","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_34/Const_1","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_34/clip_by_value/Minimum/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_34/clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_23/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_24/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/concatenate_25/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_26/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/global_average_pooling2d_5/Mean/reduction_indices","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_5/strided_slice/stack","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_5/strided_slice/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_5/strided_slice/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_5/Reshape/shape/1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_5/Reshape/shape/2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_5/Reshape/shape/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_43/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1248"},{"size":"312"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_43/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"312"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_44/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"312"},{"size":"1248"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_44/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1248"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_40/Const","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_40/Const_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_40/clip_by_value/Minimum/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_40/clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_27/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_28/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_29/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_30/concat/axis","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/global_average_pooling2d_6/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_6/strided_slice/stack","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_6/strided_slice/stack_1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_6/strided_slice/stack_2","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_6/Reshape/shape/1","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/reshape_6/Reshape/shape/2","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/reshape_6/Reshape/shape/3","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_49/Conv2D/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"664"},{"size":"168"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_49/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"168"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_50/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"168"},{"size":"664"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_50/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"664"}]}}}}},
          {"name":"StatefulPartitionedCall/model/activation_46/Const","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_46/Const_1","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/activation_46/clip_by_value/Minimum/y","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/activation_46/clip_by_value/y","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/concatenate_31/concat/axis","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_53/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"664"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_53/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/flatten/Const","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/embedding/batchnorm/mul","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/embedding/batchnorm/sub","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"input_1","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"112"},{"size":"112"},{"size":"3"}]}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"20"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"20"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"20"},{"size":"10"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_1/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"10"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"20"},{"size":"10"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_2/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"10"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"10"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"20"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_5/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"20"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_3/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"20"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_3/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_5/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"20"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_5/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_2/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_3/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_4/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_4/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_4/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_6/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"46"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_6/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"46"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"46"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_6/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"46"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_7/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"92"},{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_7/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"16"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_7/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"16"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"32"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_11/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_8/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"46"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_8/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"46"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv2d_12/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"52"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_12/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"52"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"46"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_8/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"46"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"92"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_9/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"92"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_11/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"92"},{"size":"26"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_11/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"26"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"26"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_10/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"26"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_13/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"52"},{"size":"78"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d_13/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"78"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d_12/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"78"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
