{
  "format": "graph-model",
  "generatedBy": "https://github.com/leondgarse/Keras_insightface",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"112"},{"size":"112"},{"size":"3"}]}}
      },
      "outputs":
      {
          "embedding": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"256"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"StatefulPartitionedCall/model/conv1_pad/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_2/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_4/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_6/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_12/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/flatten/Const","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/embedding/batchnorm/Rsqrt","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model/embedding/batchnorm/sub","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"input_1","op":"Placeholder","attr":{"shape":{"shape":{"dim":[{"size":"-1"},{"size":"112"},{"size":"112"},{"size":"3"}]}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv1/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_12/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_1/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_2/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_2/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"1024"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_3/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_3/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_4/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_4/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_13/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1024"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_5/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_5/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_13/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_6/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_6/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_7/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_7/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"1024"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_8/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_8/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_9/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_9/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1024"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_10/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_10/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_11/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_11/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_12/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv1_pad/Pad","op":"Pad","input":["input_1","StatefulPartitionedCall/model/conv1_pad/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv1_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv1_pad/Pad","StatefulPartitionedCall/model/conv1/Conv2D_weights","StatefulPartitionedCall/model/conv1/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_1/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv1_relu/Relu6","StatefulPartitionedCall/model/conv_dw_1/depthwise_weights","StatefulPartitionedCall/model/conv_dw_1/depthwise_bn_offset"],"attr":{"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_1/depthwise","StatefulPartitionedCall/model/conv_pw_1/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_1/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_2/Pad","op":"Pad","input":["StatefulPartitionedCall/model/conv_pw_1_relu/Relu6","StatefulPartitionedCall/model/conv_pad_2/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_2/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pad_2/Pad","StatefulPartitionedCall/model/conv_dw_2/depthwise_weights","StatefulPartitionedCall/model/conv_dw_2/depthwise_bn_offset"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_2/depthwise","StatefulPartitionedCall/model/conv_pw_2/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_2/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"use_cudnn_on_gpu":{"b":true},"epsilon":{"f":0},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_3/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_2_relu/Relu6","StatefulPartitionedCall/model/conv_dw_3/depthwise_weights","StatefulPartitionedCall/model/conv_dw_3/depthwise_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_3/depthwise","StatefulPartitionedCall/model/conv_pw_3/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_3/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_4/Pad","op":"Pad","input":["StatefulPartitionedCall/model/conv_pw_3_relu/Relu6","StatefulPartitionedCall/model/conv_pad_4/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_4/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pad_4/Pad","StatefulPartitionedCall/model/conv_dw_4/depthwise_weights","StatefulPartitionedCall/model/conv_dw_4/depthwise_bn_offset"],"attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_4/depthwise","StatefulPartitionedCall/model/conv_pw_4/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_4/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_5/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_4_relu/Relu6","StatefulPartitionedCall/model/conv_dw_5/depthwise_weights","StatefulPartitionedCall/model/conv_dw_5/depthwise_bn_offset"],"attr":{"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_5/depthwise","StatefulPartitionedCall/model/conv_pw_5/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_5/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_6/Pad","op":"Pad","input":["StatefulPartitionedCall/model/conv_pw_5_relu/Relu6","StatefulPartitionedCall/model/conv_pad_6/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_6/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pad_6/Pad","StatefulPartitionedCall/model/conv_dw_6/depthwise_weights","StatefulPartitionedCall/model/conv_dw_6/depthwise_bn_offset"],"attr":{"strides":{"list":{"i":["1","2","2","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"padding":{"s":"VkFMSUQ="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_6/depthwise","StatefulPartitionedCall/model/conv_pw_6/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_6/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"epsilon":{"f":0},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_7/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_6_relu/Relu6","StatefulPartitionedCall/model/conv_dw_7/depthwise_weights","StatefulPartitionedCall/model/conv_dw_7/depthwise_bn_offset"],"attr":{"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_7/depthwise","StatefulPartitionedCall/model/conv_pw_7/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_7/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"epsilon":{"f":0},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_8/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_7_relu/Relu6","StatefulPartitionedCall/model/conv_dw_8/depthwise_weights","StatefulPartitionedCall/model/conv_dw_8/depthwise_bn_offset"],"attr":{"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_8/depthwise","StatefulPartitionedCall/model/conv_pw_8/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_8/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"explicit_paddings":{"list":{}},"epsilon":{"f":0}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_9/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_8_relu/Relu6","StatefulPartitionedCall/model/conv_dw_9/depthwise_weights","StatefulPartitionedCall/model/conv_dw_9/depthwise_bn_offset"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_9/depthwise","StatefulPartitionedCall/model/conv_pw_9/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_9/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"epsilon":{"f":0},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_10/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_9_relu/Relu6","StatefulPartitionedCall/model/conv_dw_10/depthwise_weights","StatefulPartitionedCall/model/conv_dw_10/depthwise_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_10/depthwise","StatefulPartitionedCall/model/conv_pw_10/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_10/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_11/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_10_relu/Relu6","StatefulPartitionedCall/model/conv_dw_11/depthwise_weights","StatefulPartitionedCall/model/conv_dw_11/depthwise_bn_offset"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_11/depthwise","StatefulPartitionedCall/model/conv_pw_11/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_11/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_12/Pad","op":"Pad","input":["StatefulPartitionedCall/model/conv_pw_11_relu/Relu6","StatefulPartitionedCall/model/conv_pad_12/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_12/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pad_12/Pad","StatefulPartitionedCall/model/conv_dw_12/depthwise_weights","StatefulPartitionedCall/model/conv_dw_12/depthwise_bn_offset"],"attr":{"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"VkFMSUQ="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_12/depthwise","StatefulPartitionedCall/model/conv_pw_12/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_12/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_13/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_12_relu/Relu6","StatefulPartitionedCall/model/conv_dw_13/depthwise_weights","StatefulPartitionedCall/model/conv_dw_13/depthwise_bn_offset"],"attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13_relu/Relu6","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/conv_dw_13/depthwise","StatefulPartitionedCall/model/conv_pw_13/Conv2D_weights","StatefulPartitionedCall/model/conv_pw_13/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"epsilon":{"f":0},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdTY="]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_13_relu/Relu6","StatefulPartitionedCall/model/depthwise_conv2d/depthwise_weights","StatefulPartitionedCall/model/depthwise_conv2d/depthwise_bn_offset"],"attr":{"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"padding":{"s":"VkFMSUQ="}}},
          {"name":"StatefulPartitionedCall/model/conv2d/BiasAdd","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/depthwise_conv2d/depthwise","StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp","StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}}}},
          {"name":"StatefulPartitionedCall/model/flatten/Reshape","op":"Reshape","input":["StatefulPartitionedCall/model/conv2d/BiasAdd","StatefulPartitionedCall/model/flatten/Const"],"attr":{"Tshape":{"type":"DT_INT32"},"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/embedding/batchnorm/mul","op":"Mul","input":["StatefulPartitionedCall/model/flatten/Reshape","StatefulPartitionedCall/model/embedding/batchnorm/Rsqrt"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/embedding/batchnorm/add_1","op":"AddV2","input":["StatefulPartitionedCall/model/embedding/batchnorm/mul","StatefulPartitionedCall/model/embedding/batchnorm/sub"],"attr":{"T":{"type":"DT_FLOAT"}}},
          {"name":"Identity","op":"Identity","input":["StatefulPartitionedCall/model/embedding/batchnorm/add_1"],"attr":{"T":{"type":"DT_FLOAT"}}}
      ],
      "library": {},
      "versions":
      {
          "producer": 1087
      }
  },
  "weightsManifest":
  [
      {
          "paths": ["insightface-mobilenet-emore.bin"],
          "weights": [{"name":"StatefulPartitionedCall/model/conv1_pad/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model/conv_pad_2/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model/conv_pad_4/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model/conv_pad_6/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model/conv_pad_12/Pad/paddings","shape":[4,2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model/conv2d/Conv2D/ReadVariableOp","shape":[1,1,1024,256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv2d/BiasAdd/ReadVariableOp","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/flatten/Const","shape":[2],"dtype":"int32"},{"name":"StatefulPartitionedCall/model/embedding/batchnorm/Rsqrt","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/embedding/batchnorm/sub","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv1/Conv2D_weights","shape":[3,3,3,32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv1/Conv2D_bn_offset","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_12/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_1/depthwise_weights","shape":[3,3,32,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_1/depthwise_bn_offset","shape":[32],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_1/Conv2D_weights","shape":[1,1,32,64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_1/Conv2D_bn_offset","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_2/depthwise_weights","shape":[3,3,64,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_2/depthwise_bn_offset","shape":[64],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_2/Conv2D_weights","shape":[1,1,64,128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_12/Conv2D_weights","shape":[1,1,512,1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_2/Conv2D_bn_offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_3/depthwise_weights","shape":[3,3,128,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_3/depthwise_bn_offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_3/Conv2D_weights","shape":[1,1,128,128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_12/Conv2D_bn_offset","shape":[1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_3/Conv2D_bn_offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_4/depthwise_weights","shape":[3,3,128,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_4/depthwise_bn_offset","shape":[128],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_4/Conv2D_weights","shape":[1,1,128,256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_4/Conv2D_bn_offset","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_13/depthwise_weights","shape":[3,3,1024,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_5/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_5/depthwise_bn_offset","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_5/Conv2D_weights","shape":[1,1,256,256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_5/Conv2D_bn_offset","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_13/depthwise_bn_offset","shape":[1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_6/depthwise_weights","shape":[3,3,256,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_6/depthwise_bn_offset","shape":[256],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_6/Conv2D_weights","shape":[1,1,256,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_6/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_7/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_7/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_7/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_13/Conv2D_weights","shape":[1,1,1024,1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_7/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_8/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_8/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_8/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_13/Conv2D_bn_offset","shape":[1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_8/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_9/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_9/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_9/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_9/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_weights","shape":[3,3,1024,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_10/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_10/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_10/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_10/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/depthwise_conv2d/depthwise_bn_offset","shape":[1024],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_11/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_11/depthwise_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_11/Conv2D_weights","shape":[1,1,512,512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_pw_11/Conv2D_bn_offset","shape":[512],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}},{"name":"StatefulPartitionedCall/model/conv_dw_12/depthwise_weights","shape":[3,3,512,1],"dtype":"float32","quantization":{"dtype":"float16","original_dtype":"float32"}}]
      }
  ]
}