{
  "format": "graph-model",
  "generatedBy": "https://github.com/leondgarse/Keras_insightface",
  "convertedBy": "https://github.com/vladmandic",
  "signature":
  {
      "inputs":
      {
          "input_1": {"name":"input_1:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"112"},{"size":"112"},{"size":"3"}]}}
      },
      "outputs":
      {
          "embedding": {"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"512"}]}}
      }
  },
  "modelTopology":
  {
      "node":
      [
          {"name":"StatefulPartitionedCall/model/p_re_lu/Neg","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_2/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_4/Pad/paddings","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_6/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_12/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_1/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_1/ReadVariableOp_1","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/ReadVariableOp_1","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/flatten/Const","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},
          {"name":"StatefulPartitionedCall/model/dense/MatMul/Cast","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"4608"},{"size":"512"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/dense/BiasAdd/Cast","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_2/batchnorm/Rsqrt","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_2/batchnorm/sub","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"input_1","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"112"},{"size":"112"},{"size":"3"}]}}}},
          {"name":"StatefulPartitionedCall/model/conv1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"3"},{"size":"32"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv1/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_1/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_1/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"64"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_2/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_2/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_3/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_3/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_4/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_4/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_5/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_5/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_6/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_6/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_7/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_7/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_8/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_8/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_9/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_9/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_10/depthwise_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_10/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_11/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_11/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_12/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_12/depthwise_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"1024"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_13/depthwise_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1024"},{"size":"1"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_13/depthwise_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_HALF"},"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"1024"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_HALF","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"512"}]}}},"dtype":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},
          {"name":"StatefulPartitionedCall/model/conv1/Cast","op":"Cast","input":["input_1"],"attr":{"SrcT":{"type":"DT_FLOAT"},"DstT":{"type":"DT_HALF"},"Truncate":{"b":false}}},
          {"name":"StatefulPartitionedCall/model/conv1/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv1/Cast","StatefulPartitionedCall/model/conv1/Conv2D_weights"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"T":{"type":"DT_HALF"},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv1_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv1/Conv2D","StatefulPartitionedCall/model/conv1/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv1_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv1_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv1_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv1_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv1_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_1/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv1_swish/mul_1","StatefulPartitionedCall/model/conv_dw_1/depthwise_weights","StatefulPartitionedCall/model/conv_dw_1/depthwise_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_HALF"},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_1_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_1/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_1_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_1/depthwise","StatefulPartitionedCall/model/conv_dw_1_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_1_swish/mul_1","StatefulPartitionedCall/model/conv_pw_1/Conv2D_weights"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_1/Conv2D","StatefulPartitionedCall/model/conv_pw_1/Conv2D_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_1_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_1_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_1_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_1_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_2/Pad","op":"Pad","input":["StatefulPartitionedCall/model/conv_pw_1_swish/mul_1","StatefulPartitionedCall/model/conv_pad_2/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_2/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pad_2/Pad","StatefulPartitionedCall/model/conv_dw_2/depthwise_weights","StatefulPartitionedCall/model/conv_dw_2/depthwise_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"padding":{"s":"VkFMSUQ="},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"num_args":{"i":"1"},"strides":{"list":{"i":["1","2","2","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_2_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_2/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_2_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_2/depthwise","StatefulPartitionedCall/model/conv_dw_2_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_2_swish/mul_1","StatefulPartitionedCall/model/conv_pw_2/Conv2D_weights"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_HALF"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_2/Conv2D","StatefulPartitionedCall/model/conv_pw_2/Conv2D_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_2_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_2_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_2_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_2_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_3/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_2_swish/mul_1","StatefulPartitionedCall/model/conv_dw_3/depthwise_weights","StatefulPartitionedCall/model/conv_dw_3/depthwise_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_3_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_3/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_3_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_3/depthwise","StatefulPartitionedCall/model/conv_dw_3_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_3_swish/mul_1","StatefulPartitionedCall/model/conv_pw_3/Conv2D_weights"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_3/Conv2D","StatefulPartitionedCall/model/conv_pw_3/Conv2D_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_3_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_3_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_3_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_3_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_4/Pad","op":"Pad","input":["StatefulPartitionedCall/model/conv_pw_3_swish/mul_1","StatefulPartitionedCall/model/conv_pad_4/Pad/paddings"],"attr":{"T":{"type":"DT_HALF"},"Tpaddings":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_4/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pad_4/Pad","StatefulPartitionedCall/model/conv_dw_4/depthwise_weights","StatefulPartitionedCall/model/conv_dw_4/depthwise_bn_offset"],"attr":{"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"padding":{"s":"VkFMSUQ="}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_4_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_4/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_4_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_4/depthwise","StatefulPartitionedCall/model/conv_dw_4_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_4_swish/mul_1","StatefulPartitionedCall/model/conv_pw_4/Conv2D_weights"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_4/Conv2D","StatefulPartitionedCall/model/conv_pw_4/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_4_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_4_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_4_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_4_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_5/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_4_swish/mul_1","StatefulPartitionedCall/model/conv_dw_5/depthwise_weights","StatefulPartitionedCall/model/conv_dw_5/depthwise_bn_offset"],"attr":{"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_HALF"},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_5_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_5/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_5_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_5/depthwise","StatefulPartitionedCall/model/conv_dw_5_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_5_swish/mul_1","StatefulPartitionedCall/model/conv_pw_5/Conv2D_weights"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_5/Conv2D","StatefulPartitionedCall/model/conv_pw_5/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_5_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_5_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_5_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_5_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_6/Pad","op":"Pad","input":["StatefulPartitionedCall/model/conv_pw_5_swish/mul_1","StatefulPartitionedCall/model/conv_pad_6/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_6/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pad_6/Pad","StatefulPartitionedCall/model/conv_dw_6/depthwise_weights","StatefulPartitionedCall/model/conv_dw_6/depthwise_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"strides":{"list":{"i":["1","2","2","1"]}},"num_args":{"i":"1"},"padding":{"s":"VkFMSUQ="},"T":{"type":"DT_HALF"},"dilations":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_6_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_6/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_6_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_6/depthwise","StatefulPartitionedCall/model/conv_dw_6_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_6_swish/mul_1","StatefulPartitionedCall/model/conv_pw_6/Conv2D_weights"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"T":{"type":"DT_HALF"},"use_cudnn_on_gpu":{"b":true},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_6/Conv2D","StatefulPartitionedCall/model/conv_pw_6/Conv2D_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_6_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_6_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_6_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_6_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_7/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_6_swish/mul_1","StatefulPartitionedCall/model/conv_dw_7/depthwise_weights","StatefulPartitionedCall/model/conv_dw_7/depthwise_bn_offset"],"attr":{"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"T":{"type":"DT_HALF"},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_7_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_7/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_7_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_7/depthwise","StatefulPartitionedCall/model/conv_dw_7_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_7_swish/mul_1","StatefulPartitionedCall/model/conv_pw_7/Conv2D_weights"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_7/Conv2D","StatefulPartitionedCall/model/conv_pw_7/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_7_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_7_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_7_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_7_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_8/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_7_swish/mul_1","StatefulPartitionedCall/model/conv_dw_8/depthwise_weights","StatefulPartitionedCall/model/conv_dw_8/depthwise_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_8_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_8/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_8_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_8/depthwise","StatefulPartitionedCall/model/conv_dw_8_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_8_swish/mul_1","StatefulPartitionedCall/model/conv_pw_8/Conv2D_weights"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_HALF"},"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_8/Conv2D","StatefulPartitionedCall/model/conv_pw_8/Conv2D_bn_offset"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_8_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_8_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_8_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_8_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_9/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_8_swish/mul_1","StatefulPartitionedCall/model/conv_dw_9/depthwise_weights","StatefulPartitionedCall/model/conv_dw_9/depthwise_bn_offset"],"attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_HALF"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_9_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_9/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_9_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_9/depthwise","StatefulPartitionedCall/model/conv_dw_9_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_9_swish/mul_1","StatefulPartitionedCall/model/conv_pw_9/Conv2D_weights"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_9/Conv2D","StatefulPartitionedCall/model/conv_pw_9/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_9_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_9_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_9_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_9_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_10/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_9_swish/mul_1","StatefulPartitionedCall/model/conv_dw_10/depthwise_weights","StatefulPartitionedCall/model/conv_dw_10/depthwise_bn_offset"],"attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_10_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_10/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_10_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_10/depthwise","StatefulPartitionedCall/model/conv_dw_10_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_10_swish/mul_1","StatefulPartitionedCall/model/conv_pw_10/Conv2D_weights"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_HALF"},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_10/Conv2D","StatefulPartitionedCall/model/conv_pw_10/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_10_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_10_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_10_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_10_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_11/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_10_swish/mul_1","StatefulPartitionedCall/model/conv_dw_11/depthwise_weights","StatefulPartitionedCall/model/conv_dw_11/depthwise_bn_offset"],"attr":{"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_11_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_11/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_11_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_11/depthwise","StatefulPartitionedCall/model/conv_dw_11_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_11_swish/mul_1","StatefulPartitionedCall/model/conv_pw_11/Conv2D_weights"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_11/Conv2D","StatefulPartitionedCall/model/conv_pw_11/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_11_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_11_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_11_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_11_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pad_12/Pad","op":"Pad","input":["StatefulPartitionedCall/model/conv_pw_11_swish/mul_1","StatefulPartitionedCall/model/conv_pad_12/Pad/paddings"],"attr":{"Tpaddings":{"type":"DT_INT32"},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_12/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pad_12/Pad","StatefulPartitionedCall/model/conv_dw_12/depthwise_weights","StatefulPartitionedCall/model/conv_dw_12/depthwise_bn_offset"],"attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","2","2","1"]}},"T":{"type":"DT_HALF"},"explicit_paddings":{"list":{}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"VkFMSUQ="}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_12_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_12/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_12_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_12/depthwise","StatefulPartitionedCall/model/conv_dw_12_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_12_swish/mul_1","StatefulPartitionedCall/model/conv_pw_12/Conv2D_weights"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"},"padding":{"s":"U0FNRQ=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_12/Conv2D","StatefulPartitionedCall/model/conv_pw_12/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_12_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_12_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_12_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_12_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_13/depthwise","op":"FusedDepthwiseConv2dNative","input":["StatefulPartitionedCall/model/conv_pw_12_swish/mul_1","StatefulPartitionedCall/model/conv_dw_13/depthwise_weights","StatefulPartitionedCall/model/conv_dw_13/depthwise_bn_offset"],"attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_13_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_dw_13/depthwise"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_dw_13_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_dw_13/depthwise","StatefulPartitionedCall/model/conv_dw_13_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_dw_13_swish/mul_1","StatefulPartitionedCall/model/conv_pw_13/Conv2D_weights"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13_bn/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv_pw_13/Conv2D","StatefulPartitionedCall/model/conv_pw_13/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13_swish/Sigmoid","op":"Sigmoid","input":["StatefulPartitionedCall/model/conv_pw_13_bn/FusedBatchNormV3"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv_pw_13_swish/mul_1","op":"Mul","input":["StatefulPartitionedCall/model/conv_pw_13_bn/FusedBatchNormV3","StatefulPartitionedCall/model/conv_pw_13_swish/Sigmoid"],"attr":{"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/conv2d/Conv2D","op":"Conv2D","input":["StatefulPartitionedCall/model/conv_pw_13_swish/mul_1","StatefulPartitionedCall/model/conv2d/Conv2D_weights"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_HALF"},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3","op":"BiasAdd","input":["StatefulPartitionedCall/model/conv2d/Conv2D","StatefulPartitionedCall/model/conv2d/Conv2D_bn_offset"],"attr":{"T":{"type":"DT_HALF"},"data_format":{"s":"TkhXQw=="}}},
          {"name":"StatefulPartitionedCall/model/p_re_lu/Relu","op":"Prelu","input":["StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3","StatefulPartitionedCall/model/p_re_lu/Neg"]},
          {"name":"StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3","op":"FusedBatchNormV3","input":["StatefulPartitionedCall/model/p_re_lu/Relu","StatefulPartitionedCall/model/batch_normalization_1/ReadVariableOp","StatefulPartitionedCall/model/batch_normalization_1/ReadVariableOp_1","StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/ReadVariableOp","StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/ReadVariableOp_1"],"attr":{"exponential_avg_factor":{"f":1},"data_format":{"s":"TkhXQw=="},"is_training":{"b":false},"T":{"type":"DT_HALF"},"U":{"type":"DT_FLOAT"},"epsilon":{"f":0.001}}},
          {"name":"StatefulPartitionedCall/model/flatten/Reshape","op":"Reshape","input":["StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3","StatefulPartitionedCall/model/flatten/Const"],"attr":{"T":{"type":"DT_HALF"},"Tshape":{"type":"DT_INT32"}}},
          {"name":"StatefulPartitionedCall/model/dense/MatMul","op":"MatMul","input":["StatefulPartitionedCall/model/flatten/Reshape","StatefulPartitionedCall/model/dense/MatMul/Cast"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_HALF"},"transpose_a":{"b":false},"transpose_b":{"b":false}}},
          {"name":"StatefulPartitionedCall/model/dense/BiasAdd","op":"BiasAdd","input":["StatefulPartitionedCall/model/dense/MatMul","StatefulPartitionedCall/model/dense/BiasAdd/Cast"],"attr":{"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_HALF"}}},
          {"name":"StatefulPartitionedCall/model/batch_normalization_2/Cast","op":"Cast","input":["StatefulPartitionedCall/model/dense/BiasAdd"],"attr":{"SrcT":{"type":"DT_HALF"},"DstT":{"type":"DT_FLOAT"},"Truncate":{"b":false}}},
